bpel-service/xts_wsat/bpel/src/test/resources/xml/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exam="http://www.jboss.org/bpel/examples">
   <soapenv:Header/>
   <soapenv:Body>
      <exam:orderRequestType>
         <name>Ivo</name>
         <from>Praha</from>
         <to>Brno</to>
         <persons>1</persons>
         <arrival>2012-03-18</arrival>
         <departure>2012-03-23</departure>
      </exam:orderRequestType>
   </soapenv:Body>
</soapenv:Envelope>